# AssemblyNewTypeWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..AssemblyNewTypeWarn Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Edits to these assemblies match existing type and will inherit that name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AssemblyNewTypeWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyNewTypeWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AssemblyNewTypeWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace